export let Mas_DecoderType: string[] = [
  "T25 (USB)",
  'T26 (MODBUS)',
  'T22 (COM)',
  'Удаленный',
  'Симулятор Т37',
  'T37 (ETHERNET)',
  'Т35 (USB)',
  'Т36 (RS-485, MODBUS)',
  'T32 (RS-232)',
  'T42 (RS-232)',
  'Т45 (USB)',
  'Т46 (RS-485, MODBUS)',
  'T47 (ETHERNET)',
  'T48 (6-Компонентный USB)',
  'Симулятор T48 (6-Компонентный USB)',
  'Т42 (USB)',
  'Т42 (RS-232)',
  'Т42 (RS-485, MODBUS)',
  'Т42 (ETHERNET)',
  'M56 (CAN)',
  'M56 (USB)',
  'Датчик M42WG (Wi-Fi)',
  'T48V2 (6-Компонентный USB)',
  'Т48(RS-485, MODBUS)',
  'Т42(VCOM)',
  'Т48(VCOM)',
];
export let Mas_Mnog: number[] = [1.0, 1.5, 2.0, 2.5, 3.0, 4.0, 5.0, 6.0, 8.0, 1.2];
export let Mas_TipMom: string[] = ["MA20A", // Не вращ Датчик МА20 с угломером и кнопкой управления  
  "MA20",  // Не вращ
  "M20C",  // Вращ
  "M41E",  // Не вращ на пониженную температуру
  "M40 ",  // Вращ
  "MA20E", // Вращ
  "M25",   // Вращ
  "M01",   // Не вращ Динамометрическая отвертка
  "M02",   // Не вращ Динамометрический ключ
  "M26",   // Вращ вальный
  "M27",   // Вращ вальный квадратный
  "MA20B"  // Фланец-квадрат
];

export let Mas_TipSila: string[] = ["YYY", "CT1", "CT2", "CT3", "CT4", "CT5"];
export let Mas_TipPressure: string[] = ["PR-28", "PR-28"];
export let Mas_TipTenzo: string[] = ["At50/T25"];
export let MasNazvD: [string, string][] = [
  ["Датчик крутящего момента", "Nm"],
  ["Датчик силы", "N"],
  ["Датчик массы", "g"],
  ["Датчик давления", "Pa"],
  ["Датчик перемещения", "m"],
  ["Датчик угла", "..."],
  ["Датчик скорости", "m/s"],
  ["Тензоусилитель", "V/V"]
];

export let MasEdIzm: string[] = [
  "Nm ", //           [L"Датчик крутящего момента",L"Nm "},
  "N  ", //           {L"Датчик силы",L"N  "},
  "g  ", //           {L"Датчик массы",L"g  "},
  "Pa ", //           {L"Датчик давления",L"Pa "},
  "m  ", //           {L"Датчик перемещения",L"m  "},
  "...", //           {L"Датчик угла",L"..."},
  "m/c", //           {L"Датчик скорости",L"m/s"},
  "mV/V"  //          {L"Тензоусилитель",L"mV/V"}
];

export let Mas_NazvIzmVel: string[] = [
  'Момент',
  'Сила',
  'Масса',
  'Давление',
  "",
  "",
  "",
  'Вх.сигнал',
];
//---------------------------------------------------------------------------
//   0    1    2       3       4      5    6        7       8     9        A       B        C      D     E    F

export let Mas_NomZn: string[][] = [
  ["-0", "-0", "-0,1", "-1", "-10", "-100", "-1K", "-10K", "-100K", "-1M", "-10M", "-100M", "-1000", "-100", "-10", "-1"],   // 0
  ["-0", "-0", "-0,15", "-1,5", "-15", "-150", "-1,5K", "-15K", "-150K", "-1,5M", "-15M", "-150M", "-1500", "-150", "-15", "-1,5"], // 1
  ["-0", "-0", "-0,2", "-2", "-20", "-200", "-2K", "-20K", "-200K", "-2M", "-20M", "-200M", "-2000", "-200", "-20", "-2"],   // 2
  ["-0", "-0", "-0,25", "-2,5", "-25", "-250", "-2,5K", "-25K", "-250K", "-2,5M", "-25M", "-250M", "-2500", "-250", "-25", "-2,5"], // 3
  ["-0", "-0", "-0,3", "-3", "-30", "-300", "-3K", "-30K", "-300K", "-3M", "-30M", "-300M", "-3000", "-300", "-30", "-3"],   // 4
  ["-0", "-0", "-0,4", "-4", "-40", "-400", "-4K", "-40K", "-400K", "-4M", "-40M", "-400M", "-4000", "-400", "-40", "-4"],   // 5
  ["-0", "-0", "-0,5", "-5", "-50", "-500", "-5K", "-50K", "-500K", "-5M", "-50M", "-500M", "-5000", "-500", "-50", "-5"],   // 6
  ["-0", "-0", "-0,6", "-6", "-60", "-600", "-6K", "-60K", "-600K", "-6M", "-60M", "-600M", "-6000", "-600", "-60", "-6"],   // 7
  ["-0", "-0", "-0,8", "-8", "-80", "-800", "-8K", "-80K", "-800K", "-8M", "-80M", "-800M", "-8000", "-800", "-80", "-8"],   // 8
  ["-0", "-0", "-0,12", "-1,2", "-12", "-120", "-1,2K", "-12K", "-120K", "-1,2M", "-12M", "-120M", "-1200", "-120", "-12", "-1,2"]  // 9
];
//---------------------------------------------------------------------------
//    8      9      A      B      C       D      E      F
export let Mas_NomZn6: string[][] = [
  ["-0,1", "-1", "-10", "-100", "-1K", "-10K", "-100K", "-1M"],   // 0
  ["-0,15", "-1,5", "-15", "-150", "-1,5K", "-15K", "-150K", "-1,5M"],   // 1
  ["-0,2", "-2", "-20", "-200", "-2K", "-20K", "-200K", "-2M",],   // 2
  ["-0,25", "-2,5", "-25", "-250", "-2,5K", "-25K", "-250K", "-2,5M"],   // 3
  ["-0,3", "-3", "-30", "-300", "-3K", "-30K", "-300K", "-3M",],   // 4
  ["-0,4", "-4", "-40", "-400", "-4K", "-40K", "-400K", "-4M",],   // 5
  ["-0,5", "-5", "-50", "-500", "-5K", "-50K", "-500K", "-5M",],   // 6
  ["-0,6", "-6", "-60", "-600", "-6K", "-60K", "-600K", "-6M",],   // 7
  ["-0,8", "-8", "-80", "-800", "-8K", "-80K", "-800K", "-8M",],   // 8
  ["-0,12", "-1,2", "-12", "-120", "-1,2K", "-12K", "-120K", "-1,2M"]    // 9
];
//---------------------------------------------------------------------------
export let MasRazmPower: string[] = ["mk", "m", "", "k", "M"];

//--------------------- Массив точек Х в которых надо делать пересчет количества надписей на оси Х
export let MasBorderForLabelWidthChange: number[] = [
  10, 100, 1000, 10000, 100000, 1000000
];
//---------------------------------------------------------------------------
export let MasNaimSensora: string[] = ["Fx", "Fy", "Fz", "Mx", "My", "Mz", "Ures_Speed"];  // UserSpeed?  
//---------------------------------------------------------------------------
/*
export let _SobitieTyp MasSobitieTyp[KOLTYPOVSOB]=[
    [clLime,   "Start\x0    "],   // 10 Старт записи на диск
    [clLime,   "Stop\x0     "],   // 11 Конец записи на диск
    [clYellow, "Pause\x0    "],   // 12 Пауза в записи
    [clAqua,   "Resume\x0   "],   // 13 Продолжение после паузы
    [clGreen,  "Click\x0    "],   // 14 Клик оператора
    [clRed,    "TrOFF\x0    "],   // 15 датчик отключился
    [clGreen,  "TrON\x0     "],   // 16 датчик подключился
    [clRed,    "DecOFF\x0   "],   // 17 декодер отключился
    [clGreen,  "DecON\x0    "],   // 18 декодер подключился
    [clRed,    "ServDisc\x0 "],   // 19 сервер отключился
    [clGreen,  "ServConn\x0 "],   // 20 сервер подключился
    [clRed,    "LineOFF\x0  "],   // 21 линия  отключилась
    [clGreen,  "LineON\x0   "],   // 22 линия  подключилась
    [clRed,    "SensorOFF\x0"],   // 23 сенсор отключился
    [clGreen,  "SensorON\x0 "],   // 24 сенсор подключился
    [clBlue,   "Begin\x0    "],   // 25 начало измерений
    [clBlue,   "End\x0      "],   // 26 конец измерений
    [clBlue,   "FRStart\x0  "],   // 27 начало Фрагмента
    [clBlue,   "FREnd\x0    "]    // 28 конец Фрагмента
  ];
  */
//---------------------------------------------------------------------------
export let MasSila: string[] = ["mN", "N", "kN"];
export let MasMoment: string[] = ["mNm", "Nm", "kNm"];
//---------------------------------------------------------------------------
export let MasEdinicPopravok: number[] = [0.1, 0.001, 0.01, 0.0001];
export let MasEdRazm: number[] = [1, 0.01, 0.1, 0.001];
//---------------------------------------------------------------------------
// Первая цифра: 3 - не вращ. датчик
//               4 - Вращ. датчик
//               5 - Спец. изделие
export let MasTransducerType: string[] = [
  "M36",       // Не вращ 6-компонентный датчик                   00
  "M42",       // Вращ 2-компонентный датчик                      01
  "M56",       // Вращ 6-компонентный датчик для колеса комбайна  02
  "M36V2",     // Не вращ 6-компонентный датчик V2                03
  "M42V2",     // Вращ 2-компонентный датчик V2                     04
  "M56V2"      // Вращ 6-компонентный датчик V2 для колеса комбайна  05
];